cask_args appdir: '/Applications'

# Taps
tap 'ataraxy-labs/tap'
tap 'basecamp/tap'
tap 'dicklesworthstone/tap'
tap 'hashicorp/tap'
tap 'oven-sh/bun'

# Core CLI tools
brew 'bash'
brew 'gh'
brew 'gum'
brew 'imagemagick'
brew 'just'
brew 'vim'
brew 'wget'
brew 'yt-dlp'

# Shell & terminal
brew 'tmux'
brew 'reattach-to-user-namespace'

# Dev tools & runtimes
brew 'ast-grep'
brew 'exiftool'
brew 'go'
brew 'lazygit'
brew 'mise'
brew 'rust'
brew 'uv'
brew 'oven-sh/bun/bun'

# Cloud & infra
brew 'awscli'
brew 'crane'
brew 'doctl'
brew 'hashicorp/tap/terraform'

# Agent tooling
brew 'dicklesworthstone/tap/br'
brew 'dicklesworthstone/tap/dcg'
brew 'ataraxy-labs/tap/sem'
brew 'dicklesworthstone/tap/bv'
brew 'dicklesworthstone/tap/cass'
brew 'dicklesworthstone/tap/ubs'
brew 'dicklesworthstone/tap/xf'

# Apps
cask '1password'
cask '1password-cli'
cask 'basecamp'
cask 'claude-code'
cask 'codex'
cask 'ghostty'
cask 'dicklesworthstone/tap/ntm'
cask 'trimmy'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
cask 'zoom'

# Fonts
cask 'font-fira-code-nerd-font'
cask 'font-menlo-for-powerline'
